# Словник для зберігання кодів абетки Морзе
morse_code = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-',
    'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-',
    'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..',
    '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.'
}


# Функція для перетворення тексту на код Морзе
def text_to_morse(text):
    morse_text = ''
    for char in text.upper():
        if char in morse_code:
            morse_text += morse_code[char] + ' '
    return morse_text


while True:
    user_text = input("Введіть текст для перетворення (0 для виходу): ")
    if user_text == '0':
        break

    morse_text = text_to_morse(user_text)
    print("Текст у коді Морзе:", morse_text)
